// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
int n1 = 2, n2 = 3, n3 = 7;
int max = n1;

if(n2 > max)
{
    max = n2;
}

if(n3 > max)
{
    max = n3;
}

Console.WriteLine(max);

n1 = 44;
n2 = 5;
n3 = 78;
max = n1;

if(n2 > max)
{
    max = n2;
}

if(n3 > max)
{
    max = n3;
}

Console.WriteLine(max);

n1 = 22;
n2 = 3;
n3 = 9;
max = n1;

if(n2 > max)
{
    max = n2;
}

if(n3 > max)
{
    max = n3;
}

Console.WriteLine(max);
